#################################################################################################
## evaluation of difference between audit opinion for internal accounting management for firms ##
#################################################################################################

#######################################
## load data from package accounting ##
#######################################

# install_github("blu2ego/accounting")
library(accounting)
data("internal")

###############################################
## 01. process data to extract the audit opinion ##
###############################################

###########################################################################
## 01.01 internal에서 내부회계관리제도 감사보고서 텍스트만 분리 추출하기 ##
###########################################################################
firms_obs <- length(internal)
iao <- vector(mode = "list", firms_obs) # 사전에 리스트의 길이를 정의. 이렇게 사전에 정의하지 않으면, subscript out of bounds 에러가 남.
for (i in 1:firms_obs) {
  year_obs <- length(internal[[i]])
  for (j in 1:year_obs) {
    iao[[i]][[j]] <- internal[[i]][[j]][["내부회계관리제도 감사보고서"]]  
  }
}

#############################################################
## 01.01에서 추출한 텍스트에서 필요 없는 특수 문자 등 제거 ##
#############################################################


